Homework/Simple_Shell/simple_shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Simple Shell</title>
<!-- 2018-03-26 Mon 08:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />
</head>
<body>
<div id="content">
<h1 class="title">Simple Shell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. What to do</a>
<ul>
<li><a href="#sec-2-1">2.1. Step 1 (10 points)</a></li>
<li><a href="#sec-2-2">2.2. Step 2 (10 points)</a></li>
<li><a href="#sec-2-3">2.3. Step 3 (10 points)</a></li>
<li><a href="#sec-2-4">2.4. Follow Specs (15 points)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Common problems</a>
<ul>
<li><a href="#sec-3-1">3.1. My simpleshell processes are not appearing defunct. Why?</a></li>
<li><a href="#sec-3-2">3.2. My zombie count is getting messed up when I use system to start a non background process</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This code represents a simple shell.  The shell is the program that
allows you to run commands on the command line (i.e. the thing you
type 'cd' and 'gcc blah blah blah' into).  The most famous shell is
called bash - that's probably the one you're using right now.  Just
like preferred text editors, unix people tend to have a preferred
shell (alternatives include zsh, csh).
</p>

<p>
Right now all this shell does is run commands that you type in.  We're
going to ask you to add some features.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What to do</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Step 1 (10 points)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We want to be able to run programs in the background (i.e. start up
one program while another keeps running).  Using fork, modify the code
so if you prefix a command with ``BG'' it runs that command in the
background.  That is, if you type:
</p>

<pre class="example">
BGemacs 
</pre>

<p>
it will open an emacs window and return to the prompt before
emacs finishes running.  You should be able to run as many background
commands as you like.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Step 2 (10 points)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Modify the BG feature so that when a background command finishes
running, the shell prints out ``Background command finished''.  To do
this you'll have to add an additional fork - a fork for a parent
process that uses wait and a fork for its child that runs the actual
command.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Step 3 (10 points)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Run your simpleshell, start a program in the background, and run ``ps
-a''.  How many instances of the program are running?  Next, exit the
background program, but do not exit \textrm{simpleshell}, and run ``ps
-a'' again.  You should see something like ``simpleshell &lt;defunct&gt;''.
Defunct processes are zombie processes as described in class and on
page 121 of your textbook. 
<a href="https://www.howtogeek.com/119815/htg-explains-what-is-a-zombie-process-on-linux/">How-to Geek</a>
has a nice article explaining what zombie processes are. and how to deal
with them.
</p>

<p>
To fix this, we need to wait on all our processes that are finishing.
BUT if we wait too much, we'll end up stalled, waiting on a process
that hasn't finished yet.  Solution?  The SIGCHILD signal.  This
signal is sent when a child process finishes.
</p>

<p>
Add a signal handler for the SIGCHILD signal that increments a count
of the running zombies.  Then, when the user enters the command "kill
zombies" wait an appropriate number of times to kill all the currently
existing zombies.
</p>

<p>
BTW, as you kill zombies, be sure to mask the SIGCHLD signal to ensure
you don't end up with a concurrency bug where the count changes as you
kill.  ALTHOUGH, this doesn't resolve the problem quite 100%&#x2026;see if
you can figure out the obscure case where a zombie or two might slip
through the net.  That's strictly for fun though&#x2026;to solve that
problem we'd have to use waitpid instead of wait and let's not open that can
of worms.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Follow Specs (15 points)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
In order to receive full credit for this assignment, your code must correctly
implement the specs given in steps 1 to 3, above. When this is graded, we will
not only look for functionality, but will also look through the code. Some of
things we will look for are highlighted in the grading rubric that accompanies
the initial code.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Common problems</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> My simpleshell processes are not appearing defunct. Why?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
It's usually the same issue - your child that prints "Background
process finished" is not actually exiting.  Instead, it's going back
into the command processing while(1) loop that it inherited when it
was forked from its parent.  It won't actually process any commands of
course because it's not the parent, but it also won't end which means
it can't be a zombie (you must die first to become a zombie right?).
</p>


<p>
To fix this be sure your child exits after printing background process
finished.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> My zombie count is getting messed up when I use system to start a non background process</h3>
<div class="outline-text-3" id="text-3-2">
<p>
So it shouldn't amaze you to know that system actually forks a child
when you call it, then waits.  But this still triggers a SIGCHLD,
which increments your zombie count (inappropriately, because you have
already done the wait).
</p>

<p>
You might be inclined to mask the signal, but that causes more harm
than good because when you unmask SIGCHLD will come though.
</p>

<p>
Instead, just decrement your zombie count to compensate (now I would
mask SIGCHLD while you update that count variable).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2018-03-26 Mon 08:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
